# SQL Queries with Equivalent Python code using Pandas

In [1]:
import mysql.connector as sql

In [2]:
mydb = sql.connect(
  host="localhost",
  user="root",
  password="12345"
)

In [3]:
 mycursor = mydb.cursor()

mycursor.execute("SHOW DATABASES")

for x in mycursor:
    print(x)

('cancer',)
('hello',)
('information_schema',)
('mall_customer',)
('mukesh',)
('mydatabase',)
('mysql',)
('newb',)
('performance_schema',)
('sakila',)
('shop_customers',)
('student',)
('sys',)
('testdb',)
('world',)

In [4]:
mydb = sql.connect(
  host="localhost",
  user="root",
  password="12345",
  database="shop_customers"
)

In [5]:
mycursor = mydb.cursor()

mycursor.execute("SHOW TABLES")

for x in mycursor:
    print(x)

('shop_customers',)

In [6]:
def query(sql):
    mycursor = mydb.cursor()
    
    mycursor.execute(sql)
    
    myresult = mycursor.fetchall()
    
    for x in myresult:
        print(x)

In [7]:
import pandas as pd

customers = pd.read_csv('D:\Final submission\Sql\Shop_Customers.csv')

##### ORDERBY  Clause (Ascending Order)

In [8]:
query('SELECT * FROM shop_customers WHERE Genre	 = "Female" ORDER BY Spending_Score_1_to_100')

(203, 'Female', 59, 23, 6)
(207, 'Female', 55, 32, 6)
(213, 'Female', 59, 21, 15)
(217, 'Female', 67, 26, 35)
(205, 'Female', 45, 19, 40)
(210, 'Female', 29, 17, 72)
(206, 'Female', 47, 19, 76)
(204, 'Female', 37, 23, 77)
(214, 'Female', 53, 22, 77)
(208, 'Female', 23, 24, 94)
(220, 'Female', 23, 24, 98)
(212, 'Female', 20, 19, 99)

In [9]:
#SQL Statement (Filtering on Gender colmn & Ordering By Spending_Score_1_to_100)
'''SELECT * FROM customers 
WHERE Gender = "Female" 
ORDER BY Spending_Score_1_to_100'''

# Using Pandas
customers[customers.Genre == 'Female'].sort_values('Spending_Score_1_to_100')

    CustomerID   Genre  Age  Annual_Income_K_Dollars  Spending_Score_1_to_100
2          203  Female   59                       23                        6
6          207  Female   55                       32                        6
12         213  Female   59                       21                       15
16         217  Female   67                       26                       35
4          205  Female   45                       19                       40
9          210  Female   29                       17                       72
5          206  Female   47                       19                       76
3          204  Female   37                       23                       77
13         214  Female   53                       22                       77
7          208  Female   23                       24                       94
19         220  Female   23                       24                       98
11         212  Female   20                       19                       99

##### ORDERBY Clause(Descending Order)

In [10]:
query('SELECT * FROM shop_customers WHERE Genre = "Female" ORDER BY Spending_Score_1_to_100')

(203, 'Female', 59, 23, 6)
(207, 'Female', 55, 32, 6)
(213, 'Female', 59, 21, 15)
(217, 'Female', 67, 26, 35)
(205, 'Female', 45, 19, 40)
(210, 'Female', 29, 17, 72)
(206, 'Female', 47, 19, 76)
(204, 'Female', 37, 23, 77)
(214, 'Female', 53, 22, 77)
(208, 'Female', 23, 24, 94)
(220, 'Female', 23, 24, 98)
(212, 'Female', 20, 19, 99)

In [12]:
#SQL Statement (Filtering on Gender column & Ordering By Spending_Score_1_to_100 in DESCENDING order)
'''SELECT * FROM customers 
WHERE Gender = "Female" 
ORDER BY Spending_Score_1_to_100 DESC'''

# Using Pandas
customers[customers.Genre == 'Female'].sort_values('Spending_Score_1_to_100', ascending=False)

    CustomerID   Genre  Age  Annual_Income_K_Dollars  Spending_Score_1_to_100
11         212  Female   20                       19                       99
19         220  Female   23                       24                       98
7          208  Female   23                       24                       94
3          204  Female   37                       23                       77
13         214  Female   53                       22                       77
5          206  Female   47                       19                       76
9          210  Female   29                       17                       72
4          205  Female   45                       19                       40
16         217  Female   67                       26                       35
12         213  Female   59                       21                       15
2          203  Female   59                       23                        6
6          207  Female   55                       32                        6

##### GROUPBY  Clause(Count)

In [13]:
#SQL Statement (Grouping by Genre & Age and counting each occurence of it)
'''SELECT Gender, Age, count(*) 
FROM customers 
GROUPBY Gender, Age'''

# Using Pandas
customers.groupby(['Genre', 'Age']).size().to_frame('Count').reset_index()

     Genre  Age  Count
0   Female   20      1
1   Female   23      2
2   Female   29      1
3   Female   37      1
4   Female   45      1
5   Female   47      1
6   Female   53      1
7   Female   55      1
8   Female   59      2
9   Female   67      1
10    Male   20      1
11    Male   28      1
12    Male   41      1
13    Male   48      1
14    Male   61      1
15    Male   63      1
16    Male   64      1
17    Male   67      1